#-------------------------------------------------------------------------------
from .Constraints import Constraints # 基底クラス
from ..common     import private     # プライベートメソッド
from ..common     import public      #　パブリックメソッド
#-------------------------------------------------------------------------------
class PrimaryKey(Constraints):
    """
    主キー制約クラス
    """
    def __init__(self):
        """

        """
    #---------------------------------------------------------------------------
    def toSql(self) -> str:
        """
        主キー制約のSQLを生成
        Returns:
            str: PRIMARY KEY制約のSQL
        """
        return "PRIMARY KEY"
#-------------------------------------------------------------------------------
